#include <stdio.h>
#include <math.h>
/*รถแท็กซี่คันหนึ่งมีอัตราค่าบริการดังนี้
ถ้าโดยสารต่ำกว่า 20 กิโลเมตรคิดค่าบริการ กิโลเมตรละ 30 บาท
ถ้าโดยสาร 20 - 49 กิโลเมตรคิดค่าบริการ กิโลเมตรละ 25 บาท
ถ้าโดยสาร 50 - 79 กิโลเมตรคิดค่าบริการ กิโลเมตรละ 20 บาท
ถ้าโดยสารมากกว่า 80 กิโลเมตรคิดค่าบริการ กิโลเมตรละ 15 บาท
จงคำนวณค่าบริการของรถแท็กซี่คันนี้โดยห้ามใช้ if-else และ switch-case (Level 2)*/





int main(){
    int distance, cost=15,price,d=distance;
    int k=0;
    scanf("%d",&distance);
    while(distance>0){
        distance-=2;
    }
    cost=cost+15*k;
    printf("%d\n",distance);
    return 0;
}